app/Controllers/TraceabilityController.php

    public function manufacturer()
    {
        $this->requireRole('manufacturer');
        $userId = $this->sess()->get('user_id');

        // Ambil semua raw batch dari semua supplier untuk dipilih
        $rawBatches = $this->db->table('raw_material_batches')
            ->orderBy('created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `raw_material_batches`
ORDER BY `created_at` DESC

    public function manufacturerEdit($id)
{
    $this->requireRole('manufacturer');
    $userId = $this->sess()->get('user_id');

    $product = $this->db->table('production_batches')
        ->where('id', $id)
        ->where('manufacturer_id', $userId)
        ->get()->getRowArray();

    if (!$product) {
        $this->sess()->setFlashdata('error', 'Data tidak ditemukan.');
        return redirect()->to('/traceability/manufacturer');
    }

    $rawBatches = $this->db->table('raw_material_batches')
        ->orderBy('created_at', 'DESC')
        ->get()->getResultArray();
---
SELECT *
FROM `production_batches`
WHERE `id` = '5'
AND `manufacturer_id` = '3'
SELECT *
FROM `raw_material_batches`
ORDER BY `created_at` DESC