app/Models/RekamMedisModel.php

    public function cariUser(string $username): ?array
    {
        return $this->db
                    ->table('users')
                    ->where('username', $username)
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'

    public function ambilSemua(string $search = '', int $perPage = 10): array
    {
        $builder = $this->db->table('rekam_medis');

        if ($search !== '') {
            $builder->groupStart()
                        ->like('nama_pasien', $search)
                        ->orLike('no_rm',     $search)
                        ->orLike('diagnosa',  $search)
                        ->orLike('dokter',    $search)
                    ->groupEnd();
        }

        $total = $builder->countAllResults(false);

        $page   = max(1, (int)($_GET['page'] ?? 1));
        $offset = ($page - 1) * $perPage;

        $rows = $builder
                    ->orderBy('tanggal_kunjungan', 'DESC')
                    ->orderBy('id', 'DESC')
                    ->limit($perPage, $offset)
                    ->get()
                    ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `rekam_medis`
SELECT *
FROM `rekam_medis`
ORDER BY `tanggal_kunjungan` DESC, `id` DESC
 LIMIT 10

    public function ambilSatuById(int $id): ?array
    {
        return $this->db
                    ->table('rekam_medis')
                    ->where('id', $id)
                    ->get()
                    ->getRowArray();
---
SELECT *
FROM `rekam_medis`
WHERE `id` = 10

    public function verifikasiSemua(): array
    {
        $rows = $this->db
                     ->table('rekam_medis')
                     ->orderBy('id', 'ASC')
                     ->get()
                     ->getResultArray();
---
SELECT *
FROM `rekam_medis`
ORDER BY `id` ASC

    public function statistikDashboard(): array
    {

        $totalData = $this->db->table('rekam_medis')->countAll();

        $hariIni = $this->db
                        ->table('rekam_medis')
                        ->where('tanggal_kunjungan', date('Y-m-d'))
                        ->countAllResults();


        $semuaData   = $this->verifikasiSemua();
        $totalInvalid = count(array_filter($semuaData, fn($r) => !$r['is_valid']));

        $terbaru = $this->db
                        ->table('rekam_medis')
                        ->orderBy('tanggal_kunjungan', 'DESC')
                        ->orderBy('id', 'DESC')
                        ->limit(5)
                        ->get()
                        ->getResultArray();

        $totalDokter = $this->db
                            ->table('rekam_medis')
                            ->select('dokter')
                            ->where('dokter IS NOT NULL', null, false)
                            ->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `rekam_medis`
SELECT COUNT(*) AS `numrows`
FROM `rekam_medis`
WHERE `tanggal_kunjungan` = '2026-05-30'
SELECT *
FROM `rekam_medis`
ORDER BY `tanggal_kunjungan` DESC, `id` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `rekam_medis`
WHERE dokter IS NOT NULL